src/Documents/ИТСервисы_УстановкаКвалификацииСотрудников/ИТСервисы_УстановкаКвалификацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_УстановкаКвалификацииСотрудников</name>
  <registerRecords>InformationRegister.ИТСервисы_КвалификацияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ИТСервисы_КомпетенцииСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧасовВМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Грейд</name>
      <type>
        <types>EnumRef.ИТСервисы_Грейды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомпетенцииСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.ИТСервисы_Компетенции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИТСервисы_УстановкаКвалификацииСотрудников/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СоставСотрудникПриИзменении(Элемент)
	
	СтрокаСостава = Элементы.Состав.ТекущиеДанные;
	
	Если СтрокаСостава = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, есть ли уже этот сотрудник во второй таблице, чтобы не дублировать
	ПараметрыОтбора = Новый Структура("Сотрудник", СтрокаСостава.Сотрудник);
	НайденныеСтроки = Объект.КомпетенцииСотрудников.НайтиСтроки(ПараметрыОтбора);
	
	// Если сотрудника еще нет во второй ТЧ и он заполнен в первой
	Если НайденныеСтроки.Количество() = 0 И ЗначениеЗаполнено(СтрокаСостава.Сотрудник) Тогда
		НоваяСтрокаКомпетенций = Объект.КомпетенцииСотрудников.Добавить();
		НоваяСтрокаКомпетенций.Сотрудник = СтрокаСостава.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СотрудникДляУдаления = ТекущиеДанные.Сотрудник;
		
		// Ищем все строки с этим сотрудником во второй ТЧ
		ИндексСтроки = Объект.КомпетенцииСотрудников.Количество() - 1;
		Пока ИндексСтроки >= 0 Цикл
			Если Объект.КомпетенцииСотрудников[ИндексСтроки].Сотрудник = СотрудникДляУдаления Тогда
				Объект.КомпетенцииСотрудников.Удалить(ИндексСтроки);
			КонецЕсли;
			ИндексСтроки = ИндексСтроки - 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
